## staging: ecs
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`



```terraform
Plan: 20 to add, 1 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.etl_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "etl_policies"  {
      ~ id      = "3005869351" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:GetItem",
                          - "dynamodb:ConditionCheckItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ca-central-1:005133826942:table/aggregate_metrics"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForlayer",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:005133826942:repository/covid-server/metrics-server"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/unmasked_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/unmasked_metrics_ecs",
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/masked_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/masked_metrics_ecs",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ec2:DeleteNetworkInterface",
                          - "ec2:CreateNetworkInterface",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ec2:ca-central-1:005133826942:network-interface/*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ec2:DescribeNetworkInterfaces"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:PutObjectAcl",
                          - "s3:PutObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::unmasked-metrics-snfsv-staging/*",
                          - "arn:aws:s3:::unmasked-metrics-snfsv-staging",
                          - "arn:aws:s3:::masked-metrics-snfsv-staging/*",
                          - "arn:aws:s3:::masked-metrics-snfsv-staging",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          ~ actions       = [
              - "dynamodb:BatchGetItem",
              - "dynamodb:ConditionCheckItem",
              - "dynamodb:GetItem",
              - "dynamodb:Query",
              - "dynamodb:Scan",
              + "ecr:BatchGetImage",
              + "ecr:GetDownloadUrlForlayer",
            ]
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:dynamodb:ca-central-1:005133826942:table/aggregate_metrics",
              + "arn:aws:ecr:ca-central-1:005133826942:repository/covid-server/appstore-metrics-etl",
              + "arn:aws:ecr:ca-central-1:005133826942:repository/covid-server/metrics-server",
              + "arn:aws:ecr:ca-central-1:005133826942:repository/covid-server/server-metrics-etl",
            ]
            # (1 unchanged attribute hidden)
        }
      ~ statement {
          ~ actions       = [
              - "ecr:BatchGetImage",
              - "ecr:GetDownloadUrlForlayer",
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:ecr:ca-central-1:005133826942:repository/covid-server/metrics-server",
              + "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/masked_metrics_ecs",
              + "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/masked_metrics_ecs:log-stream:*",
              + "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/unmasked_metrics_ecs",
              + "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/unmasked_metrics_ecs:log-stream:*",
              ~ (known after apply),
              ~ (known after apply),
              ~ (known after apply),
              ~ (known after apply),
              ~ (known after apply),
              ~ (known after apply),
              ~ (known after apply),
              ~ (known after apply),
            ]
            # (1 unchanged attribute hidden)
        }
      ~ statement {
          ~ actions       = [
              + "ec2:CreateNetworkInterface",
              + "ec2:DeleteNetworkInterface",
              - "logs:CreateLogGroup",
              - "logs:CreateLogStream",
              - "logs:PutLogEvents",
            ]
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              + "arn:aws:ec2:ca-central-1:005133826942:network-interface/*",
              - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/masked_metrics_ecs",
              - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/masked_metrics_ecs:log-stream:*",
              - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/unmasked_metrics_ecs",
              - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/unmasked_metrics_ecs:log-stream:*",
            ]
            # (1 unchanged attribute hidden)
        }
      ~ statement {
          ~ actions       = [
              - "ec2:CreateNetworkInterface",
              - "ec2:DeleteNetworkInterface",
              + "ec2:DescribeNetworkInterfaces",
            ]
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              + "*",
              - "arn:aws:ec2:ca-central-1:005133826942:network-interface/*",
            ]
            # (1 unchanged attribute hidden)
        }
      ~ statement {
          ~ actions       = [
              - "ec2:DescribeNetworkInterfaces",
              + "s3:PutObject",
              + "s3:PutObjectAcl",
            ]
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "*",
              + "arn:aws:s3:::masked-metrics-snfsv-staging",
              + "arn:aws:s3:::masked-metrics-snfsv-staging/*",
              + "arn:aws:s3:::unmasked-metrics-snfsv-staging",
              + "arn:aws:s3:::unmasked-metrics-snfsv-staging/*",
            ]
            # (1 unchanged attribute hidden)
        }
      - statement {
          - actions       = [
              - "s3:PutObject",
              - "s3:PutObjectAcl",
            ] -> null
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
          - resources     = [
              - "arn:aws:s3:::masked-metrics-snfsv-staging",
              - "arn:aws:s3:::masked-metrics-snfsv-staging/*",
              - "arn:aws:s3:::unmasked-metrics-snfsv-staging",
              - "arn:aws:s3:::unmasked-metrics-snfsv-staging/*",
            ] -> null
        }
    }

  # aws_iam_policy.etl_policies will be updated in-place
  ~ resource "aws_iam_policy" "etl_policies" {
        id        = "arn:aws:iam::005133826942:policy/ETLTaskExecutionPolicies"
        name      = "ETLTaskExecutionPolicies"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:GetItem",
                          - "dynamodb:ConditionCheckItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ca-central-1:005133826942:table/aggregate_metrics"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForlayer",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:005133826942:repository/covid-server/metrics-server"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/unmasked_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/unmasked_metrics_ecs",
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/masked_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/masked_metrics_ecs",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ec2:DeleteNetworkInterface",
                          - "ec2:CreateNetworkInterface",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ec2:ca-central-1:005133826942:network-interface/*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ec2:DescribeNetworkInterfaces"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:PutObjectAcl",
                          - "s3:PutObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::unmasked-metrics-snfsv-staging/*",
                          - "arn:aws:s3:::unmasked-metrics-snfsv-staging",
                          - "arn:aws:s3:::masked-metrics-snfsv-staging/*",
                          - "arn:aws:s3:::masked-metrics-snfsv-staging",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.readonly_aggregate_metrics will be created
  + resource "aws_iam_policy" "readonly_aggregate_metrics" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "ReadOnlyTableTaskExecutionPolicies"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:Scan",
                          + "dynamodb:Query",
                          + "dynamodb:GetItem",
                          + "dynamodb:ConditionCheckItem",
                          + "dynamodb:BatchGetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:ca-central-1:005133826942:table/aggregate_metrics"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.server_appstore_task_execution_role will be created
  + resource "aws_iam_role" "server_appstore_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "server_appstore_metrics_task_execution_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.readonly_table_te_etl_policies will be created
  + resource "aws_iam_role_policy_attachment" "readonly_table_te_etl_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "metrics_task_execution_role"
    }

  # aws_iam_role_policy_attachment.server_appstore_te_etl_policies will be created
  + resource "aws_iam_role_policy_attachment" "server_appstore_te_etl_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::005133826942:policy/ETLTaskExecutionPolicies"
      + role       = "server_appstore_metrics_task_execution_role"
    }

  # module.masked_appstore_metrics_etl.data.template_file.masked_metrics will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "masked_metrics"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + cpu              = 0
                  + environment      = [
                      + {
                          + name  = "MASK_DATA"
                          + value = "${mask_data}"
                        },
                      + {
                          + name  = "ENVIRONMENT"
                          + value = "${environment}"
                        },
                      + {
                          + name  = "BUCKET_NAME"
                          + value = "${bucket_name}"
                        },
                    ]
                  + essential        = true
                  + image            = "${image}"
                  + linuxParameters  = {
                      + capabilities = {
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${awslogs-group}"
                          + awslogs-region        = "${awslogs-region}"
                          + awslogs-stream-prefix = "${awslogs-stream-prefix}"
                        }
                    }
                  + mountPoints      = []
                  + name             = "${name}"
                  + portMappings     = [
                      + {
                          + containerPort = 8001
                          + hostPort      = 8001
                          + protocol      = "tcp"
                        },
                    ]
                  + volumesFrom      = []
                },
            ]
        )
      + vars     = {
          + "awslogs-group"         = "/aws/ecs/masked_appstore_metrics_ecs"
          + "awslogs-region"        = "ca-central-1"
          + "awslogs-stream-prefix" = "ecs-masked-appstore-metrics"
          + "bucket_name"           = "masked-metrics-snfsv-staging"
          + "environment"           = "staging"
          + "image"                 = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/appstore-metrics-etl:latest"
          + "mask_data"             = "True"
          + "name"                  = "masked_appstore_metrics"
        }
    }

  # module.masked_appstore_metrics_etl.aws_cloudwatch_event_rule.event_rule will be created
  + resource "aws_cloudwatch_event_rule" "event_rule" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "masked_appstore_metrics_event_rule"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(24 hours)"
      + tags                = {
          + "Name" = "masked_appstore_metrics-cw-event-rule"
        }
      + tags_all            = {
          + "Name" = "masked_appstore_metrics-cw-event-rule"
        }
    }

  # module.masked_appstore_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be created
  + resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
      + arn            = "arn:aws:ecs:ca-central-1:005133826942:cluster/in-app-metrics"
      + event_bus_name = "default"
      + id             = (known after apply)
      + role_arn       = "arn:aws:iam::005133826942:role/etl-st-cw-role"
      + rule           = "masked_appstore_metrics_event_rule"
      + target_id      = (known after apply)

      + ecs_target {
          + launch_type         = "FARGATE"
          + platform_version    = "1.4.0"
          + task_count          = 1
          + task_definition_arn = (known after apply)

          + network_configuration {
              + assign_public_ip = false
              + security_groups  = [
                  + "sg-090d16d17a0b6c2b1",
                ]
              + subnets          = [
                  + "subnet-02bfc21b518d54130",
                ]
            }
        }
    }

  # module.masked_appstore_metrics_etl.aws_cloudwatch_log_group.log will be created
  + resource "aws_cloudwatch_log_group" "log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/masked_appstore_metrics_ecs"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.masked_appstore_metrics_etl.aws_ecs_task_definition.task_def will be created
  + resource "aws_ecs_task_definition" "task_def" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::005133826942:role/container_execution_role"
      + family                   = "masked_appstore_metrics"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "CovidShield"
        }
      + tags_all                 = {
          + "CostCentre" = "CovidShield"
        }
      + task_role_arn            = (known after apply)
    }

  # module.masked_server_metrics_etl.data.template_file.masked_metrics will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "masked_metrics"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + cpu              = 0
                  + environment      = [
                      + {
                          + name  = "MASK_DATA"
                          + value = "${mask_data}"
                        },
                      + {
                          + name  = "ENVIRONMENT"
                          + value = "${environment}"
                        },
                      + {
                          + name  = "BUCKET_NAME"
                          + value = "${bucket_name}"
                        },
                    ]
                  + essential        = true
                  + image            = "${image}"
                  + linuxParameters  = {
                      + capabilities = {
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${awslogs-group}"
                          + awslogs-region        = "${awslogs-region}"
                          + awslogs-stream-prefix = "${awslogs-stream-prefix}"
                        }
                    }
                  + mountPoints      = []
                  + name             = "${name}"
                  + portMappings     = [
                      + {
                          + containerPort = 8001
                          + hostPort      = 8001
                          + protocol      = "tcp"
                        },
                    ]
                  + volumesFrom      = []
                },
            ]
        )
      + vars     = {
          + "awslogs-group"         = "/aws/ecs/masked_server_metrics_ecs"
          + "awslogs-region"        = "ca-central-1"
          + "awslogs-stream-prefix" = "ecs-masked-server-metrics"
          + "bucket_name"           = "masked-metrics-snfsv-staging"
          + "environment"           = "staging"
          + "image"                 = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:latest"
          + "mask_data"             = "True"
          + "name"                  = "masked_server_metrics"
        }
    }

  # module.masked_server_metrics_etl.aws_cloudwatch_event_rule.event_rule will be created
  + resource "aws_cloudwatch_event_rule" "event_rule" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "masked_server_metrics_event_rule"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(24 hours)"
      + tags                = {
          + "Name" = "masked_server_metrics-cw-event-rule"
        }
      + tags_all            = {
          + "Name" = "masked_server_metrics-cw-event-rule"
        }
    }

  # module.masked_server_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be created
  + resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
      + arn            = "arn:aws:ecs:ca-central-1:005133826942:cluster/in-app-metrics"
      + event_bus_name = "default"
      + id             = (known after apply)
      + role_arn       = "arn:aws:iam::005133826942:role/etl-st-cw-role"
      + rule           = "masked_server_metrics_event_rule"
      + target_id      = (known after apply)

      + ecs_target {
          + launch_type         = "FARGATE"
          + platform_version    = "1.4.0"
          + task_count          = 1
          + task_definition_arn = (known after apply)

          + network_configuration {
              + assign_public_ip = false
              + security_groups  = [
                  + "sg-090d16d17a0b6c2b1",
                ]
              + subnets          = [
                  + "subnet-02bfc21b518d54130",
                ]
            }
        }
    }

  # module.masked_server_metrics_etl.aws_cloudwatch_log_group.log will be created
  + resource "aws_cloudwatch_log_group" "log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/masked_server_metrics_ecs"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.masked_server_metrics_etl.aws_ecs_task_definition.task_def will be created
  + resource "aws_ecs_task_definition" "task_def" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::005133826942:role/container_execution_role"
      + family                   = "masked_server_metrics"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "CovidShield"
        }
      + tags_all                 = {
          + "CostCentre" = "CovidShield"
        }
      + task_role_arn            = (known after apply)
    }

  # module.unmasked_appstore_metrics_etl.data.template_file.masked_metrics will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "masked_metrics"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + cpu              = 0
                  + environment      = [
                      + {
                          + name  = "MASK_DATA"
                          + value = "${mask_data}"
                        },
                      + {
                          + name  = "ENVIRONMENT"
                          + value = "${environment}"
                        },
                      + {
                          + name  = "BUCKET_NAME"
                          + value = "${bucket_name}"
                        },
                    ]
                  + essential        = true
                  + image            = "${image}"
                  + linuxParameters  = {
                      + capabilities = {
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${awslogs-group}"
                          + awslogs-region        = "${awslogs-region}"
                          + awslogs-stream-prefix = "${awslogs-stream-prefix}"
                        }
                    }
                  + mountPoints      = []
                  + name             = "${name}"
                  + portMappings     = [
                      + {
                          + containerPort = 8001
                          + hostPort      = 8001
                          + protocol      = "tcp"
                        },
                    ]
                  + volumesFrom      = []
                },
            ]
        )
      + vars     = {
          + "awslogs-group"         = "/aws/ecs/unmasked_appstore_metrics_ecs"
          + "awslogs-region"        = "ca-central-1"
          + "awslogs-stream-prefix" = "ecs-unmasked-appstore-metrics"
          + "bucket_name"           = "unmasked-metrics-snfsv-staging"
          + "environment"           = "staging"
          + "image"                 = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/appstore-metrics-etl:latest"
          + "mask_data"             = "False"
          + "name"                  = "unmasked_appstore_metrics"
        }
    }

  # module.unmasked_appstore_metrics_etl.aws_cloudwatch_event_rule.event_rule will be created
  + resource "aws_cloudwatch_event_rule" "event_rule" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "unmasked_appstore_metrics_event_rule"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(24 hours)"
      + tags                = {
          + "Name" = "unmasked_appstore_metrics-cw-event-rule"
        }
      + tags_all            = {
          + "Name" = "unmasked_appstore_metrics-cw-event-rule"
        }
    }

  # module.unmasked_appstore_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be created
  + resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
      + arn            = "arn:aws:ecs:ca-central-1:005133826942:cluster/in-app-metrics"
      + event_bus_name = "default"
      + id             = (known after apply)
      + role_arn       = "arn:aws:iam::005133826942:role/etl-st-cw-role"
      + rule           = "unmasked_appstore_metrics_event_rule"
      + target_id      = (known after apply)

      + ecs_target {
          + launch_type         = "FARGATE"
          + platform_version    = "1.4.0"
          + task_count          = 1
          + task_definition_arn = (known after apply)

          + network_configuration {
              + assign_public_ip = false
              + security_groups  = [
                  + "sg-090d16d17a0b6c2b1",
                ]
              + subnets          = [
                  + "subnet-02bfc21b518d54130",
                ]
            }
        }
    }

  # module.unmasked_appstore_metrics_etl.aws_cloudwatch_log_group.log will be created
  + resource "aws_cloudwatch_log_group" "log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/unmasked_appstore_metrics_ecs"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.unmasked_appstore_metrics_etl.aws_ecs_task_definition.task_def will be created
  + resource "aws_ecs_task_definition" "task_def" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::005133826942:role/container_execution_role"
      + family                   = "unmasked_appstore_metrics"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "CovidShield"
        }
      + tags_all                 = {
          + "CostCentre" = "CovidShield"
        }
      + task_role_arn            = (known after apply)
    }

  # module.unmasked_server_metrics_etl.data.template_file.masked_metrics will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "masked_metrics"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + cpu              = 0
                  + environment      = [
                      + {
                          + name  = "MASK_DATA"
                          + value = "${mask_data}"
                        },
                      + {
                          + name  = "ENVIRONMENT"
                          + value = "${environment}"
                        },
                      + {
                          + name  = "BUCKET_NAME"
                          + value = "${bucket_name}"
                        },
                    ]
                  + essential        = true
                  + image            = "${image}"
                  + linuxParameters  = {
                      + capabilities = {
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${awslogs-group}"
                          + awslogs-region        = "${awslogs-region}"
                          + awslogs-stream-prefix = "${awslogs-stream-prefix}"
                        }
                    }
                  + mountPoints      = []
                  + name             = "${name}"
                  + portMappings     = [
                      + {
                          + containerPort = 8001
                          + hostPort      = 8001
                          + protocol      = "tcp"
                        },
                    ]
                  + volumesFrom      = []
                },
            ]
        )
      + vars     = {
          + "awslogs-group"         = "/aws/ecs/unmasked_server_metrics_ecs"
          + "awslogs-region"        = "ca-central-1"
          + "awslogs-stream-prefix" = "ecs-unmasked-server-metrics"
          + "bucket_name"           = "unmasked-metrics-snfsv-staging"
          + "environment"           = "staging"
          + "image"                 = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:latest"
          + "mask_data"             = "False"
          + "name"                  = "unmasked_server_metrics"
        }
    }

  # module.unmasked_server_metrics_etl.aws_cloudwatch_event_rule.event_rule will be created
  + resource "aws_cloudwatch_event_rule" "event_rule" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "unmasked_server_metrics_event_rule"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(24 hours)"
      + tags                = {
          + "Name" = "unmasked_server_metrics-cw-event-rule"
        }
      + tags_all            = {
          + "Name" = "unmasked_server_metrics-cw-event-rule"
        }
    }

  # module.unmasked_server_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be created
  + resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
      + arn            = "arn:aws:ecs:ca-central-1:005133826942:cluster/in-app-metrics"
      + event_bus_name = "default"
      + id             = (known after apply)
      + role_arn       = "arn:aws:iam::005133826942:role/etl-st-cw-role"
      + rule           = "unmasked_server_metrics_event_rule"
      + target_id      = (known after apply)

      + ecs_target {
          + launch_type         = "FARGATE"
          + platform_version    = "1.4.0"
          + task_count          = 1
          + task_definition_arn = (known after apply)

          + network_configuration {
              + assign_public_ip = false
              + security_groups  = [
                  + "sg-090d16d17a0b6c2b1",
                ]
              + subnets          = [
                  + "subnet-02bfc21b518d54130",
                ]
            }
        }
    }

  # module.unmasked_server_metrics_etl.aws_cloudwatch_log_group.log will be created
  + resource "aws_cloudwatch_log_group" "log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/unmasked_server_metrics_ecs"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.unmasked_server_metrics_etl.aws_ecs_task_definition.task_def will be created
  + resource "aws_ecs_task_definition" "task_def" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::005133826942:role/container_execution_role"
      + family                   = "unmasked_server_metrics"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "CovidShield"
        }
      + tags_all                 = {
          + "CostCentre" = "CovidShield"
        }
      + task_role_arn            = (known after apply)
    }

Plan: 20 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Releasing state lock. This may take a few moments...

```

</details>